{"class_name": "Model", "config": {"name": "model", "layers": [{"name": "sex", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int32", "sparse": false, "ragged": false, "name": "sex"}, "inbound_nodes": []}, {"name": "role", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int32", "sparse": false, "ragged": false, "name": "role"}, "inbound_nodes": []}, {"name": "total_show", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "total_show"}, "inbound_nodes": []}, {"name": "total_click", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "total_click"}, "inbound_nodes": []}, {"name": "total_vote", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "total_vote"}, "inbound_nodes": []}, {"name": "total_collection", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "total_collection"}, "inbound_nodes": []}, {"name": "total_comment", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "total_comment"}, "inbound_nodes": []}, {"name": "total_share", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "total_share"}, "inbound_nodes": []}, {"name": "age", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "age"}, "inbound_nodes": []}, {"name": "sparse_emb_sex", "class_name": "Embedding", "config": {"name": "sparse_emb_sex", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 4, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.0001, "seed": 2020, "dtype": "float32"}}, "embeddings_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-06}}, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["sex", 0, 0, {}]]]}, {"name": "sparse_emb_role", "class_name": "Embedding", "config": {"name": "sparse_emb_role", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 9, "output_dim": 4, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.0001, "seed": 2020, "dtype": "float32"}}, "embeddings_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-06}}, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["role", 0, 0, {}]]]}, {"name": "concat_3", "class_name": "Concat", "config": {"name": "concat_3", "trainable": true, "dtype": "float32", "axis": -1, "supports_masking": false}, "inbound_nodes": [[["sparse_emb_sex", 0, 0, {}], ["sparse_emb_role", 0, 0, {}]]]}, {"name": "concat_4", "class_name": "Concat", "config": {"name": "concat_4", "trainable": true, "dtype": "float32", "axis": -1, "supports_masking": false}, "inbound_nodes": [[["total_show", 0, 0, {}], ["total_click", 0, 0, {}], ["total_vote", 0, 0, {}], ["total_collection", 0, 0, {}], ["total_comment", 0, 0, {}], ["total_share", 0, 0, {}], ["age", 0, 0, {}]]]}, {"name": "linear0sparse_emb_sex", "class_name": "Embedding", "config": {"name": "linear0sparse_emb_sex", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 1, "embeddings_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "embeddings_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-06}}, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["sex", 0, 0, {}]]]}, {"name": "linear0sparse_emb_role", "class_name": "Embedding", "config": {"name": "linear0sparse_emb_role", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 9, "output_dim": 1, "embeddings_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "embeddings_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-06}}, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["role", 0, 0, {}]]]}, {"name": "flatten", "class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["concat_3", 0, 0, {}]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["concat_4", 0, 0, {}]]]}, {"name": "concat", "class_name": "Concat", "config": {"name": "concat", "trainable": true, "dtype": "float32", "axis": -1, "supports_masking": false}, "inbound_nodes": [[["linear0sparse_emb_sex", 0, 0, {}], ["linear0sparse_emb_role", 0, 0, {}]]]}, {"name": "concat_1", "class_name": "Concat", "config": {"name": "concat_1", "trainable": true, "dtype": "float32", "axis": -1, "supports_masking": false}, "inbound_nodes": [[["total_show", 0, 0, {}], ["total_click", 0, 0, {}], ["total_vote", 0, 0, {}], ["total_collection", 0, 0, {}], ["total_comment", 0, 0, {}], ["total_share", 0, 0, {}], ["age", 0, 0, {}]]]}, {"name": "concat_5", "class_name": "Concat", "config": {"name": "concat_5", "trainable": true, "dtype": "float32", "axis": -1, "supports_masking": false}, "inbound_nodes": [[["flatten", 0, 0, {}], ["flatten_1", 0, 0, {}]]]}, {"name": "linear", "class_name": "Linear", "config": {"name": "linear", "trainable": true, "dtype": "float32", "mode": 2, "l2_reg": 1e-05, "use_bias": false, "seed": 1024}, "inbound_nodes": [[["concat", 0, 0, {}], ["concat_1", 0, 0, {}]]]}, {"name": "concat_2", "class_name": "Concat", "config": {"name": "concat_2", "trainable": true, "dtype": "float32", "axis": 1, "supports_masking": false}, "inbound_nodes": [[["sparse_emb_sex", 0, 0, {}], ["sparse_emb_role", 0, 0, {}]]]}, {"name": "dnn", "class_name": "DNN", "config": {"name": "dnn", "trainable": true, "dtype": "float32", "activation": "relu", "hidden_units": [64, 32, 16], "l2_reg": 0, "use_bn": false, "dropout_rate": 0, "output_activation": null, "seed": 1024}, "inbound_nodes": [[["concat_5", 0, 0, {}]]]}, {"name": "no_mask", "class_name": "NoMask", "config": {"name": "no_mask", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["linear", 0, 0, {}]]]}, {"name": "fm", "class_name": "FM", "config": {"name": "fm", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["concat_2", 0, 0, {}]]]}, {"name": "dense", "class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dnn", 0, 0, {}]]]}, {"name": "private__add", "class_name": "_Add", "config": {"name": "private__add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["no_mask", 0, 0, {}], ["fm", 0, 0, {}], ["dense", 0, 0, {}]]]}, {"name": "prediction_layer", "class_name": "PredictionLayer", "config": {"name": "prediction_layer", "trainable": true, "dtype": "float32", "task": "binary", "use_bias": true}, "inbound_nodes": [[["private__add", 0, 0, {}]]]}], "input_layers": [["sex", 0, 0], ["role", 0, 0], ["total_show", 0, 0], ["total_click", 0, 0], ["total_vote", 0, 0], ["total_collection", 0, 0], ["total_comment", 0, 0], ["total_share", 0, 0], ["age", 0, 0]], "output_layers": [["prediction_layer", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}